#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.master: Refreshing state... [id=none]
random_pet.secret_name: Refreshing state... [id=absolutely-helped-monkfish]
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
aws_db_parameter_group.default: Refreshing state... [id=rds-pg]
data.aws_availability_zones.available: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Reading...
data.aws_ami.latest_amazon_linux: Reading...
module.memory.module.lambda_function_container_image.data.aws_region.current: Reading...
aws_secretsmanager_secret.password: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond]
module.memory.aws_dynamodb_table.basic-conversation_memory_table-table: Refreshing state... [id=levio-demo-fev-chat-history]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.ingestion.aws_s3_bucket.ingestion_source_storage: Refreshing state... [id=levio-demo-fev-storage]
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.memory.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=748480126]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.memory.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-memory]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.inference.module.lambda_function_container_image.data.aws_region.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.inference.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.memory.data.aws_dynamodb_table.person_table: Reading...
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.memory.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.ingestion.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-ingestion]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.ingestion.aws_sqs_queue.dead_letter_queue: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue_dead_letter]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-west-2]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.inference.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-inference]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a28d56b4354e1555]
module.memory.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-role-inline]
data.aws_ami.latest_amazon_linux: Read complete after 1s [id=ami-05c89af705fc8fb3c]
module.memory.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-memory-role]
module.ingestion.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-ingestion-role]
data.aws_secretsmanager_secret.password: Reading...
aws_secretsmanager_secret_version.password: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond|3682813B-FD26-444E-9A4A-059E260A3BB7]
module.inference.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-inference-role]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-memory-role-20240117200857754900000001]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3103384725]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1909623485]
module.memory.data.aws_dynamodb_table.person_table: Read complete after 1s [id=Person]
module.memory.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-role-logs]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4252567627]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-role-logs]
module.ingestion.aws_sqs_queue.queue: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue]
module.inference.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-role-logs]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-ingestion-role-20240111182508327600000001]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-memory-role-20240117200858336800000002]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-inference-role-20240114021647614000000002]
module.ingestion.aws_lambda_event_source_mapping.event_source_mapping: Refreshing state... [id=c9ba8237-858e-455f-9381-e5622914639c]
data.aws_secretsmanager_secret.password: Read complete after 0s [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond]
data.aws_secretsmanager_secret_version.password: Reading...
data.aws_secretsmanager_secret_version.password: Read complete after 0s [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond|AWSCURRENT]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-034fb73568e35a2ad]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-06f715bf935e801cd]
aws_security_group.lambda_ingestion_sg: Refreshing state... [id=sg-056eb17c17ad555ff]
aws_security_group.lambda_memory_sg: Refreshing state... [id=sg-0bebfbf6b6ac10469]
aws_security_group.jumpbox_sg: Refreshing state... [id=sg-0c8d408915a011b41]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-02d7c67035e5124fa]
module.vpc.aws_route_table.database[1]: Refreshing state... [id=rtb-0021f9c618a3119d0]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0aa60a64fc5b1a696]
aws_security_group.lambda_inference_sg: Refreshing state... [id=sg-0be84384ec4db2a87]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0634c8e7fd10a8009]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-027947bcf325829ac]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0cea1fda906409973]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bbf6497c54be8733]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-035759611c538ce80]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0559b61f5a74fcac2]
aws_security_group.dynamo_db_sg: Refreshing state... [id=sg-00aa64be66dbbf671]
module.ingestion.data.aws_iam_policy_document.sqs_policy: Reading...
module.ingestion.data.aws_iam_policy_document.sqs_policy: Read complete after 0s [id=1721867553]
aws_security_group.sm_sg: Refreshing state... [id=sg-0d150a18aaa621a04]
aws_security_group.bedrock_sg: Refreshing state... [id=sg-073098b78e8aa32b6]
aws_security_group.database_sg: Refreshing state... [id=sg-07425be98e514225f]
module.ingestion.aws_sqs_queue_policy.sqs_policy: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-027947bcf325829ac1080289494]
aws_vpc_endpoint.dynamo_db_endpoint: Refreshing state... [id=vpce-0404d422e2525bc16]
aws_vpc_endpoint.s3_endpoint: Refreshing state... [id=vpce-0a64fd872d6491e97]
module.ingestion.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=levio-demo-fev-storage]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-05a85d90c903644d5]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=ex-terraform]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0b0356ee59303c51f]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bcce440882e2dc3f]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fb53b1aed3271b31]
aws_instance.jumpbox: Refreshing state... [id=i-03a61c51dc0c480c7]
aws_vpc_endpoint.bedrock_endpoint: Refreshing state... [id=vpce-0327b452f427d62fc]
aws_vpc_endpoint.secrets_manager_endpoint: Refreshing state... [id=vpce-022eb3a6d85fa06a7]
module.memory.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-memory]
aws_db_instance.vector_db: Refreshing state... [id=db-YISND6N7BEMRMBM6WIYBKS3WJA]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=4227140251]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2773187410]
module.inference.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-role-inline]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-role-inline]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-inference-role-20240114021647067300000001]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-ingestion-role-20240111183932540100000001]
module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-ingestion]
module.inference.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-inference]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-inference"
      ~ last_modified                  = "2024-01-19T00:33:16.000+0000" -> "2024-01-19T01:23:20.000+0000"
        tags                           = {}
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_vpc_endpoint.lambda_endpoint will be created
  + resource "aws_vpc_endpoint" "lambda_endpoint" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0bebfbf6b6ac10469",
        ]
      + service_name          = "com.amazonaws.us-west-2.lambda"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-0bbf6497c54be8733",
          + "subnet-0cea1fda906409973",
        ]
      + tags_all              = {
          + "Environment" = "dev"
          + "Project"     = "levio-aws-demo-fev"
          + "Terraform"   = "true"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0a28d56b4354e1555"
    }

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-inference"
      ~ image_uri                      = "446872271111.dkr.ecr.us-west-2.amazonaws.com/inference-lambda-ecr:aa7907de0f443b5cd4754f2b8f25a022f6063785fb94f3109c6b7eb25013b04b" -> "446872271111.dkr.ecr.us-west-2.amazonaws.com/inference-lambda-ecr:fef8bd2ddcf1b39e5fdfc11bec09b113b3f5632f88d05e8febc79bcd6b5ad5e3"
      ~ last_modified                  = "2024-01-19T01:23:20.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @FloRul, Action: `pull_request`, Workflow: `Infrastructure planning and management`*